-- Лабораторна робота №1
-- студента групи АнД-31 
-- Горелик Андрій. Варіант №1

-- Завдання 1. Навести приклад виразів вказаного типу: [([Integer],[String])] 
-- [([123],['as'])]
-- [([18,15],["Andrii","Chechick"])]
-- [([456],"dgdg")]


--Завдання 2. Визначте два варіанта вказаної фунції(функція приймає три числа і перевіряє, чи значення першого
-- з них знаходиться між значеннями двох інших). 
--  Без використання кортежiв чи спискiв
f2 :: Integer->Integer->Integer->Bool
f2 a b c=b<=a && a<=c

-- Вхідні дані:
-- ghci> f2 5 4 6   
-- ВИхідні дані: 
-- True

--Висновок: Під час даної лабораторної роботи вивчив основи непроцедурної мови програмування Haskell, та реалізував функцію, що
-- приймає три числа і перевіряє, чи значення першого
-- з них знаходиться між значеннями двох інших)