-- Лабораторна робота №3
-- студента групи АнД-31 
-- Горелик Андрій. Варіант №1

-- Визначте вказані функції в кожному з завдань: 
-- 1.1) без застосування,
-- 1.2) з застосуванням вбудованих функцій.

--Завдання 1.Переписати список справа наліво.

--1.1)без застосування
module Lab3 where
reverseWithout :: [a] -> [a]
reverseWithout [] = []
reverseWithout [x] = [x]
reverseWithout (x:xs) = reverseWithout xs++ [x]

-- Вхідні дані:
-- ghci> reverseWithout "r32rfea"
-- Вихідні дані:
-- "aefr23r"


-- 1.2) з застосуванням вбудованих функцій
-- Вхідні дані:
-- ghci> Prelude.reverse "deqfqwef"
-- Вихідні дані:
-- "fewqfqed"

-- Завдання 2.Перемішування списку з n елементів: після першого розмістити останній,
-- після другого передостанній тощо. 

--2.1)
mixWithout :: [a] -> [a]
mixWithout [] = []
mixWithout [x] = [x]
mixWithout (x:xs) = [x] ++ mixWithout(reverseWithout xs)

-- Вхідні дані:
-- ghci> mix_without "123456789" 
-- Вихідні дані:
-- "192837465"

--2.2)
mixWith :: [a] -> [a]
mixWith [] = []
mixWith [x] = [x] 
mixWith (x:xs) = [x] ++ mixWith(Prelude.reverse xs)  


-- Вхідні дані:
-- ghci> mixWith "123456789" 
-- Вихідні дані:
-- "192837465"

-- Висновок: В ході виконання лабораторної роботи ознаймлено з функціями вищого порядку 
-- мови Haskell, також було створено функцію, яка перевертає елементи списку
-- та функцію перемішування елементів списку за вказаними позиціями
